[
    {
        "id": 1001,
        "name": "Курс: Networking",
        "image": "10",
        "shortName": "Networking",
        "category": "Courses",
        "description": "Работая с любыми внешними данными будь то обновление данных о погоде, стриминг музыки или просто серфинг в браузере, ваше приложение использует сетевые запросы HTTP. Именно они отвечают за все, что связанно с внешним миром.",
        "rating": 8.9,
        "students": 5334,
        "lessons": 37,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 2,
        "name": "Курс: Firebase - Наше Первое Приложение",
        "image": "12",
        "shortName": "Firebase - Наше Первое Приложение",
        "category": "Courses",
        "description": "Новый курс Firebase: Наше первое приложение познакомит Вас с основами сервиса Firebase, где мы с вами познакомимся с двумя наиболее востребованными сервисами Firebase при создании практически любого приложения - это Firebase Authentication (аутентификация пользователя) и Firebase Realtime Database (база данных, которая моментально обновляется и позволяет отображать изменения сразу после того, как они наступили).",
        "rating": 9.3,
        "students": 2355,
        "lessons": 10,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 3,
        "name": "Курс: Notifications",
        "image": "23",
        "shortName": "Notifications",
        "category": "Courses",
        "description": "Представляем вашему вниманию курс, целиком и полностью посвященный уведомлениям. Но что такое уведомления? Уведомления - это небольшие сообщения несущие пользователю важную для него информацию по вашему приложению или по какому-то событию. То есть вы уже догадываетесь, что уведомления играют важную роль во взаимодействии пользователя с приложением и могут вести к увеличению числа контактов пользователя с вашим приложением и, соответственно, к лояльности. Учитывая все это было бы неплохо знать как создавать эти самые уведомления и как кастомизировать их, чтобы точно вписать их в ваши приложения.",
        "rating": 9.2,
        "students": 1853,
        "lessons": 19,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 4,
        "name": "Курс: VK News Feed App",
        "image": "27",
        "shortName": "VK News Feed App",
        "category": "Courses",
        "description": "Задумывались ли вы, как приложения создаются в реальном мире? Хотели ли вы попробовать себя в написании полноценного современного приложения? Давно планировали начать разрабатывать интерфейс приложения через код? Представляем вам наш новый увлекательный курс который будет посвящен созданию приложения по типу новостной ленты приложения ВКонтакте используя различные JSON APIs непосредственно из сервера ВКонтакте.",
        "rating": 9.9,
        "students": 5201,
        "lessons": 32,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 5,
        "name": "Основы программирования на Swift",
        "image": "w1",
        "shortName": "Основы программирования на Swift",
        "category": "Webinars",
        "description": "Наша программа рассчитана на 16 часов совместной работы онлайн и 30 часов на домашние задания. Такая программа даст вам возможность выстроить надежный фундамент ваших знаний. Занимаясь 2 раза в неделю по 2 часа в течение 1 месяца вы получите крепкую базу современных знаний основ языка Swift! Bы сможете уверенно ориентироваться в мире кода. Ваши знания станут фундаментом, необходимым для написания ваших будущих приложений!",
        "rating": 9.3,
        "students": 943,
        "lessons": 8,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 6,
        "name": "Мои первые приложения",
        "image": "w2",
        "shortName": "Мои первые приложения",
        "category": "Webinars",
        "description": "Для того, чтобы записаться на курс Мои первые приложения Вам нужно пройти курс Основы программирования на Swift (вебинары) или курсы Основы программирования и Гид по языку программирования Swift на нашем ресурс в разделе Курсы. Это необходимая теоретическая база, которая позволит вам двигаться дальше. Занятия будут проходить 2 раза в неделю по 2 часа в течение 1 месяца. За этот период Вы не только сможете надежно освоить новые знания по языку Swift, но и закрепить полученные ранее базовые знания. Результатом вашего обучение станет написание приложения! На уроках вы будете также писать небольшие приложения, реализуя теоретические знания на практике!",
        "rating": 8.8,
        "students": 743,
        "lessons": 8,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 7,
        "name": "Swift Developer",
        "image": "w3",
        "shortName": "Swift Developer",
        "category": "Webinars",
        "description": "Вебинары построены на официальной программе Apple Программировать может каждый. \nУже 70 европейских колледжей и университетов внедрили этот курс в комплексную образовательную программу, в рамках которой каждый может научиться создавать мобильные приложения. Это образовательные учреждения Великобритании, Германии, Франции, Италии, Испании, Нидерландов, Швеции, Дании, Норвегии, Австрии, Бельгии, Чехии, Ирландии, Люксембурга, Польши и Португалии. \nТеперь и в России на наших вебинарах вы сможете учится по этой программе!",
        "rating": 9.0,
        "students": 643,
        "lessons": 24,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 8,
        "name": "Server Side Swift Developer",
        "image": "w4",
        "shortName": "Server Side Swift Developer",
        "category": "Webinars",
        "description": "Server Side Swift Developer - уже не iOS разработчик, который может писать iOS - приложения, а разработчик серверной части любых приложений! То есть эта серия дает вам новый пласт знаний на основе знаний того же Swift, которые вы можете использовать для написания своего собственного бэкенда для ваших, а может быть для приложений заказчика!",
        "rating": 9.7,
        "students": 346,
        "lessons": 24,
        "isFavorite": false,
        "isFeatured": false
    }
]
